#language: ru

@tree

Функционал: проверка работы полелей документа Заказ покупателя

Как тестировщие я хочу
проверить корректность работы полей документа Заказ покупателя
чтобы заказ можно было создавать корректно   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: проверка работы полей документа Заказ покупателя

* Открытие формы создания Заказ покупателя
И В командном интерфейсе я выбираю 'Продажи' 'Заказы покупателей'
И я нажимаю на кнопку с именем 'FormCreate'

* Проверка что поле Контагент не доступен для редактирования
И элемент формы с именем "LegalName" не доступен

* Заполнение поля Партнер
И я нажимаю кнопку выбора у поля с именем "Partner"
Тогда открылось окно 'Партнеры'
И в таблице "List" я перехожу к строке:
	| 'Код' | 'Наименование'         |
	| '10'  | 'Розничный покупатель' |
И в таблице "List" я активизирую поле с именем "Description"
И в таблице "List" я выбираю текущую строку
Тогда открылось окно 'Заказ покупателя (создание) *'
И в таблице "ItemList" я активизирую поле с именем "ItemListLineNumber"

* Проверка заполнения полей Партнер и соглашение
	Тогда элемент формы с именем "Partner" стал равен 'Розничный покупатель'
	Тогда элемент формы с именем "Agreement" стал равен 'Розничное'
		
И я закрываю все окна клиентского приложения

	