#language: ru

@ExportScenarios
@IgnoreOnCiMainBuild

Функционал: Проверка документа заказ

Как Администратор я хочу
проверить форму заказ
чтобы убедится в корректности заполнения   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий:Заполнение шапки заказа
* Создание нового заказа
	И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
	Тогда открылось окно 'Заказы товаров'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
* Заполнение полей
	Когда открылось окно 'Заказ (создание)'
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
	И из выпадающего списка с именем "Покупатель" я выбираю точное значение 'Мосхлеб ОАО'
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Строящийся склад'
* Проверка наличия данных в полях
	И реквизиты формы имеют значение:
		| 'Имя'                  | 'Значение'             |
		| 'Автор'                | 'Администратор'        |
		| 'Валюта'               | ''                     |
		| 'ВидЦен'               | 'Оптовая'              |
		| 'Номер'                | ''                     |
		| 'Организация'          | 'ООО \"1000 мелочей\"' |
		| 'Покупатель'           | 'Мосхлеб ОАО'          |
		| 'Склад'                | 'Строящийся склад'     |
		| 'СостояниеЗаказа'      | 'Открыт'               |
		| 'ТоварыИтогКоличество' | '0'                    |
		| 'ТоварыИтогСумма'      | '0'                    |


сценарий: добавления товаров
* Добавление товаров
	Когда открылось окно 'Заказ (создание) *'
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Торт '
	И я перехожу к следующему реквизиту
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Босоножки'
	И я перехожу к следующему реквизиту
И значение поля с именем "ТоварыИтогКоличество" содержит текст "2"

сценарий: номер
И я запоминаю значение поля "Номер" как "Номер"

сценарий: закрытия формы заказа
* Провести и закрыть
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна 'Заказ (создание) *' в течение 20 секунд
