#language: ru
@Отчеты
@tree

Функционал: Тестирование отчета Продажи D2001

Как тестировщик я хочу
протестировать отображение возвратов в отчете D2001 
чтобы данные отображались корректно   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание отчета
И В командном интерфейсе я выбираю 'Отчеты' 'D2001 Продажи'
И я нажимаю на кнопку с именем 'FormGenerate'
И в табличном документе 'Result' я перехожу к ячейке "R1C1"

*  проверка отображения возвратов
Тогда табличный документ "Result" содержит строки:
	| 'Март 2021'                | '-2,000' | '-680,00' | '-566,66' | '' |
	| 'Товар с характеристиками' | '-1,000' | '-190,00' | '-158,33' | '' |
	| 'S/Красный'                | '-1,000' | '-190,00' | '-158,33' | '' |
	| 'Товар без характеристик'  | '-1,000' | '-490,00' | '-408,33' | '' |
	| 'Товар без характеристик'  | '-1,000' | '-490,00' | '-408,33' | '' |
И я закрываю все окна клиентского приложения







